БИТУправление_медицинским_центром_демо/src/Documents/УстановкаГрафиковРаботы/УстановкаГрафиковРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаГрафиковРаботы</name>
  <registerRecords>InformationRegister.ГрафикиРаботы</registerRecords>
  <attributes>
    <name>Режим</name>
    <type>
      <types>EnumRef.ВидыУстановкиГрафиков</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьСписокСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ГрафикиРаботы</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Смена</name>
      <type>
        <types>CatalogRef.Смены</types>
      </type>
    </attributes>
    <attributes>
      <name>Кабинет</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени</name>
      <type>
        <types>CatalogRef.ВидыВремениГрафика</types>
      </type>
    </attributes>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>удалитьСотрудникОборудование</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСоздания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Documents/УстановкаГрафиковРаботы/Forms/ШапкаСобытия/Module.bsl
#Область РазделОписанияПеременных

&НаКлиенте
Перем мНаименованиеТекущегоВидаВремени;

#КонецОбласти

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ВидВремени) Тогда
		ВидВремени = Параметры.ВидВремени;
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.Название) Тогда
		Название = Параметры.Название;
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.Комментарий) Тогда
		Комментарий = Параметры.Комментарий;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьЭлементовОписанияСобытия();
	
	мНаименованиеТекущегоВидаВремени = Строка(ВидВремени);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если ГрафикиСотрудников.ЭтоОбычноеРабочееВремя(ВидВремени) Тогда
		Название = "";
		Комментарий = "";
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("ВидВремени, Название, Комментарий", ВидВремени, Название, Комментарий);
	ЭтаФорма.Закрыть(СтруктураВозврата);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СобытиеВидВремениПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ВидВремени) Тогда
		ВидВремени = ПредопределенноеЗначение("Справочник.ВидыВремениГрафика.РабочееВремя");
	КонецЕсли;
	
	УстановитьДоступностьЭлементовОписанияСобытия();
	
	НаименованиеВидаВремени = Строка(ВидВремени);
	Если СокрЛП(Название) = мНаименованиеТекущегоВидаВремени
		Или ПустаяСтрока(Название)
	Тогда
		Название = НаименованиеВидаВремени;
	КонецЕсли;
	мНаименованиеТекущегоВидаВремени = НаименованиеВидаВремени;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьЭлементовОписанияСобытия()
	
	ЭтоПростоеРабочееВремя = ГрафикиСотрудников.ЭтоОбычноеРабочееВремя(ВидВремени);
	Элементы.СобытиеНазвание.Доступность	= Не ЭтоПростоеРабочееВремя;
	Элементы.СобытиеКомментарий.Доступность	= Не ЭтоПростоеРабочееВремя;
	
КонецПроцедуры

#КонецОбласти
